---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Length
zh: 长度
source: html/8f4832bf-355c-3d6a-0ed1-4ca75be25ca5.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Length Property

**中文**: 长度

The length of the pipe. Units: (ft).

## Syntax (C#)
```csharp
public double Length { get; }
```